In [1]:
import pandas as pd

In [2]:
employees = {
    "imię" : ["Jan","Paweł","Marek","Zenek"],
    "nazwisko": ["Kowalski","Nowak","Zieliński","Martyniuk"],
    "rok urodzenia" : [1970, 1980, 1990, 1969 ]
}

employees

{'imię': ['Jan', 'Paweł', 'Marek', 'Zenek'],
 'nazwisko': ['Kowalski', 'Nowak', 'Zieliński', 'Martyniuk'],
 'rok urodzenia': [1970, 1980, 1990, 1969]}

In [3]:
df = pd.DataFrame(employees)
df

    imię   nazwisko  rok urodzenia
0    Jan   Kowalski           1970
1  Paweł      Nowak           1980
2  Marek  Zieliński           1990
3  Zenek  Martyniuk           1969

In [5]:
list(df.index)

[0, 1, 2, 3]

In [6]:
df.columns

Index(['imię', 'nazwisko', 'rok urodzenia'], dtype='object')

In [7]:
df["imię"]

0      Jan
1    Paweł
2    Marek
3    Zenek
Name: imię, dtype: object

In [8]:
df.imię

0      Jan
1    Paweł
2    Marek
3    Zenek
Name: imię, dtype: object

In [9]:
df[ ["imię","nazwisko"] ]

    imię   nazwisko
0    Jan   Kowalski
1  Paweł      Nowak
2  Marek  Zieliński
3  Zenek  Martyniuk

In [10]:
df[["imię"]]

    imię
0    Jan
1  Paweł
2  Marek
3  Zenek

In [11]:
empty_df = pd.DataFrame()
empty_df

Empty DataFrame
Columns: []
Index: []

In [13]:
df.columns[2] = "rok_urodzenia"

TypeError: Index does not support mutable operations

In [14]:
df.columns = ["imię", "nazwisko", "rok_urodzenia"]
df

    imię   nazwisko  rok_urodzenia
0    Jan   Kowalski           1970
1  Paweł      Nowak           1980
2  Marek  Zieliński           1990
3  Zenek  Martyniuk           1969

In [15]:
df.rok_urodzenia

0    1970
1    1980
2    1990
3    1969
Name: rok_urodzenia, dtype: int64

In [17]:
df["wiek"] = 2022 - df.rok_urodzenia
df

    imię   nazwisko  rok_urodzenia  wiek
0    Jan   Kowalski           1970    52
1  Paweł      Nowak           1980    42
2  Marek  Zieliński           1990    32
3  Zenek  Martyniuk           1969    53

In [22]:
df = df[ df.columns.sort_values(ascending=False) ]
df

   wiek  rok_urodzenia   nazwisko   imię
0    52           1970   Kowalski    Jan
1    42           1980      Nowak  Paweł
2    32           1990  Zieliński  Marek
3    53           1969  Martyniuk  Zenek

In [27]:
from datetime import datetime as dt

df["Wiek"] = dt.now().year - df.rok_urodzenia
df

C:\Users\kurs\AppData\Local\Temp/ipykernel_4084/2903464482.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df["Wiek"] = dt.now().year - df.rok_urodzenia

   wiek  rok_urodzenia   nazwisko   imię  Wiek
0    52           1970   Kowalski    Jan    52
1    42           1980      Nowak  Paweł    42
2    32           1990  Zieliński  Marek    32
3    53           1969  Martyniuk  Zenek    53

In [29]:
del(df["wiek"])
df

   rok_urodzenia   nazwisko   imię  Wiek
0           1970   Kowalski    Jan    52
1           1980      Nowak  Paweł    42
2           1990  Zieliński  Marek    32
3           1969  Martyniuk  Zenek    53

In [30]:
df.values

array([[1970, 'Kowalski', 'Jan', 52],
       [1980, 'Nowak', 'Paweł', 42],
       [1990, 'Zieliński', 'Marek', 32],
       [1969, 'Martyniuk', 'Zenek', 53]], dtype=object)

In [33]:
df.rok_urodzenia += 5
df

   rok_urodzenia   nazwisko   imię  Wiek
0           1975   Kowalski    Jan    52
1           1985      Nowak  Paweł    42
2           1995  Zieliński  Marek    32
3           1974  Martyniuk  Zenek    53

In [34]:
df["Wiek"] = 2022 - df.rok_urodzenia
df

   rok_urodzenia   nazwisko   imię  Wiek
0           1975   Kowalski    Jan    47
1           1985      Nowak  Paweł    37
2           1995  Zieliński  Marek    27
3           1974  Martyniuk  Zenek    48

In [41]:
employees = []
employees.append({
    "imię": "Jan", "nazwisko":"Kowalski", "rok urodzenia":1980
})
employees.append({
    "imię": "Paweł", "nazwisko":"Nowak", "rok urodzenia":1990
})
employees.append({
    "imię": "Marek", "nazwisko":"Zieliński", "rok urodzenia":1970
})

employees

[{'imię': 'Jan', 'nazwisko': 'Kowalski', 'rok urodzenia': 1980},
 {'imię': 'Paweł', 'nazwisko': 'Nowak', 'rok urodzenia': 1990},
 {'imię': 'Marek', 'nazwisko': 'Zieliński', 'rok urodzenia': 1970}]

In [45]:
df = pd.DataFrame(employees, index=["jk","pn","mz"])
df

     imię   nazwisko  rok urodzenia
jk    Jan   Kowalski           1980
pn  Paweł      Nowak           1990
mz  Marek  Zieliński           1970

In [46]:
import numpy as np

In [47]:
np.random.seed(0)
arr = np.random.randint(-10, 11, (5,4))
arr

array([[  2,   5, -10,  -7],
       [ -7,  -3,  -1,   9],
       [  8,  -6,  -4,   2],
       [ -9,  -4,  -3,   4],
       [  7,  -5,   3,  -2]])

In [50]:
pd.DataFrame(arr, columns=["A","B","C","D"], index=['K',"L","M","N","Q"])

   A  B   C  D
K  2  5 -10 -7
L -7 -3  -1  9
M  8 -6  -4  2
N -9 -4  -3  4
Q  7 -5   3 -2